{
    "posts": [
        {
            "title": "Arthur Brown [UK] - Strange World of Arthur Brown + Support: Fancy Lee + Afterparty: DJ Impaler // Sold out — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-05-31T20:00:00.0200",
                "endDate": "2024-06-01T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6569bcce580911672b05206e/1716370006082/header-abnota.jpg?format=1500w"
                }
            ],
            "body": "The God of Hellfire - Den legendariske og oprindelige shock rocker kommer forbi Stengade!\n\"Without Arthur Brown there would be no Alice Cooper\" - Alice Cooper\n\"A guy called Arthur Brown... was a big influence of mine...\" - Bruce Dickinson\nBrown har haft en betydelig indflydelse på blandt andre Alice Cooper, David Bowie, Peter Gabriel, Marilyn Manson, George Clinton, Kiss, King Diamond og Bruce Dickinson fra Iron Maiden, og hans sange er blevet coveret eller samplet af en række kunstnere herunder Ozzy Osbourne, Vidunderbarnet, Marilyn Manson, Who og Death Grips.\nBrowns stemme og især hans høje banshee-skrig er en forløber for banshee-skrigen hos mange senere heavy metal-sangere, og hans teatralske koncepter og scenetilstedeværelse såsom ansigtsmakeup, især hans sorte og hvide ansigtsmaling (corpse paint), voodoo dans og flammehjelm var banebrydende for meget af det, der skulle blive shock rock og progressiv rock.\nArthur Brown:\nArthur Brown is an English rock singer and songwriter best known for his flamboyant theatrical performances, and his powerful, wide- ranging operatic voice. He has been a major influence on a wide range of musicians due to his outstanding vocal ability and willd stage persona and concepts. He is considered a pioneer of shock rock and progressive rock and influential on heavy metal music.\nBrown lead his bands the Crazy World of Arthur Brown and Arthur Browns Kingdom Come, followed by a varied solo career. He associated with Jimi Hendrix, The Who, Frank Zappa, Hawkwind, Klaus Schultze, Alice Cooper. A cameo appearance in the cult film “Tommy”, with Eric Clapton and The Who. Countless collaborations; The Alan Parsons Project , The Stranglers, The Prodigy…\nHis bestknown 1968 single “Fire”, number 1 in the UK singles chart and Canada, and a number 2 on the US Billboard Hot 100. The album “The Crazy World Of Arthur Brown” had top ten success on both sides of the Atlantic. Following “Fire”, the press would often refer to Brown as “The God of Hellfire”, in reference to the opening shouted line of the song.\nArthur and his extensive back catalogue are signed to Cherry Red Records. 2020 Arthur signed to Prophecy records and a unique new album and art box set was released in June 2022 - to much acclaim and press coverage\nA collaboration with Cleopatra Records was also released in 2022\nArthur shows no signs of stopping or slowing down. 2022, saw the launch of his new multi- media show “A Human Perspective”.\nhttps://open.spotify.com/artist/4Wyn0ejiSIAgFhCL6zbTRm...\nhttps://www.facebook.com/arthurbrownmusic/\nhttps://www.instagram.com/godofhellfire_actual/\nhttps://www.thegodofhellfire.com/\n+ Support: Fancy Lee\nFancy Lee is the hottest new psychedelic blues band, that will make you leave that no-good man behind and take a jive on the darker side of life!\nWith a rebellious woodstock energy, Fancy Lee invites listeners into psychedelic tales of voodoo witches, swamp folk and murderous women.\nOur music isn’t just for groovin’, it’s for making a wild one out of you, a rebel and a thinker.\n“For a band with obvious inspiration in psychedelic rock, it was remarkable that Fancy Lee's songs were so concise and disciplined in execution. There were no endless solos or idling in deep grooves; the tracks were delivered with punch and precision without in any way compromising the semi-mystical voodoo vibe.\nFancy Lee proved to be a strong live band and an exciting and unique new name on the Danish scene for blues and related genres. We look forward to seeing more from this orchestra.” - Jakob Wandam, Blues News.\nhttps://open.spotify.com/artist/1llowWMlshKf2gZ6wnz1Sd?si=CbwGqP7mQdSHzAi9g4a5HQ\nhttps://www.facebook.com/FancyLeeLaveau/\n'\nDJ Impaler' fra Metal Magic Festival sørger for gode tunes før, i mellem og efter koncerterne!\n------------------------------------------------\nEntry: 180 kr in pre-sale / 200kr at the door!\nPre-Sale: https://bit.ly/47zBpbS",
            "genre": "rock",
            "url": "https://billetto.dk/e/arthur-brown-uk-strange-world-of-arthur-brown-billetter-904538",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "The Ruins of Beverast [DE] + Special Guests: Wayfarer [US] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-06-09T20:00:00.0200",
                "endDate": "2024-06-09T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65d2305261b3205079820c1c/1715178364559/header-trob.jpg?format=1500w"
                }
            ],
            "body": "The Ruins Of Beverast sjette fuld længde 'The Thule Grimoires' kom ind på de tyske albumhitlister og vandt den berømte \"Preis der Deutschen Schallplattenkritik\". Den fortsætter den klangfulde vandretur på tværs af anekumeniske sfærer, der danner sig og kæmper for den evigt rasende krig mod giftige og uhyggelige indtrængere af menneskelig oprindelse.\n“The constant mish mashing of genres [...] ended up as yet another masterpiece for The Ruins Of Beverast.” —\nantichristmagazine.com\nWayfarer vender tilbage til Stengade hvor de præsenterer det nye fuldlængde-album American Gothic. Et definerende statement af tung western musik, der udforsker selve nationens mørke sjæl. Anført af kraftfulde riffs, dyster melodsik følsomhed og spids sangskrivning fungerer denne plade som en begravelse for den amerikanske drøm.\n“Wayfarer have been building to this moment for most of a decade, the promise of an awe-inspiring widescreen black metal masterpiece fulfilled.” — TREBLE Zine\nThe Ruins of Beverast:\nThe Ruins Of Beverast were formed in early 2003 and named after the most bloodcurdling occasion being part of the ancient Mid- and Northeuropean eschatology – the collapse of the giant bridge Bifröst. This incident bears analogy to the musical aura of The Ruins Of Beverast, which builds a sonic landscape of a downtuned ground and barren, massive, surreal mountain formations; this landscape’s atmosphere exhales psychotic, ancient and undead elements and is uncomfortably coloured. The Ruins Of Beverast narrate fables of the darkest secrets in human history and present.\nFive full-lengths albums and several EP-, Split- and Compilation-releases were published through Van Records since then, the acclaimed “Exuvia” LP in 2017 as latest output. A new album is on its way and scheduled for a release in February 2021.\n\"The Thule Grimoires\" are The Ruins Of Beverast's 6th spawn in full length and continue the sonorous wandering across anecumenical spheres that form up and embattle for the ever raging war against poisonous and verminous trespassers of human origin. The seven works evolve around discarnate, spiritful protagonists that join the brave and inexorable powers of nature against their foe. These sceneries are rooted within the familiar TROBesque experience, grim and low-bottomed monolithic tone, enriched with morbid melodic facets and surreal soundscapes.\nAs live-formation The Ruins Of Beverast is a strong force since Roadburn 2013, a festivalthis band already joined twice with special shows. Since then the band has played very succesful Europe- and US-tours and was present on many well-established club-shows and festivals like Hellfest, Inferno, Incubate, Party.San Open Air and Beyond The Gates, to just name a few.\nLet not misled men explore it.\nhttps://open.spotify.com/artist/1RtWv2DQzIGsnjHPXBRaR5?si=KTx2p7LgTDiPZHCDZgrzxA\nhttps://www.facebook.com/.../The-Ruins-Of.../100050277618207\nWayfarer:\nWAYFARER is black metal of the American West. A cavalcade of fury, melancholia, and dust-laden storytelling; the band is informed by the fierce and adventurous spectrum of heavy music, along with the stark Americana of the “Denver Sound” artists that carved the identity of their home.\nIn A Romance With Violence, their most fully realized effort to date, WAYFARER presents a searing silver-screen requiem for the myth of the West. This new work sees them at their most intense and triumphant, as well as at their most pensive. Bold, rhythmic and riff laden, the band’s pointed expedition across the frontiers of black and extreme metal are tinged with the grit and genuine air of artists like Sixteen Horsepower and Jay Munly, and the majestic heights of the Ennio Morricone/Sergio Leone collaborations.\nThrough seven harrowing and triumphant anthems of the high plains, the album paints a poignant exploration of heroes and killers, the setting sun of a romantic era, and the shadow it has cast on the world we live in today.Recorded in the midst of the pandemic by Pete deBoer (Blood Incantation, Dreadnought), A Romance With Violence was mixed by the inimitable Colin Marston (Krallice, Gorguts), and Mastered by V. Santura (Triptykon, Dark Fortress). The album was released in October of 2020 via Profound Lore Records and received outstanding acclaim from the likes of Decibel Magazine, Metal Hammer, Revolver Magazine, The Pit, Invisible Oranges, Metal Injection, and so many more. A Romance With Violence also caught the eye of Century Media Records who signed the band for a worldwide deal in 2021.\nAfter ten years of existence, the band presents American Gothic – a defining statement of Western heavy music that explores the dark soul of the nation itself. This time working alongside accomplished producer Arthur Rizk (Eternal Champion, Kreator), the band brings an aggressive and expansive vision to life in a new full-length LP.\nLed by powerful riffing, bleak melodic sensibilities, and pointed songwriting, this record serves as a funeral for the American dream. Caked in dust, and buried deep in blood and gunpowder, it paints a brutal and beautiful portrait, and sees Wayfarer elevate their unique and genuine brand of metal to new heights.\n“What we have now is a world full of oil drillers, and railroad barons. Cattle thieves and company men. This is the new American Gothic.”\nhttps://www.facebook.com/wayfarercolorado/\nhttps://open.spotify.com/artist/4HcBIH7pVbrRRwHnEqxpka?si=SfvIamUQQCWMgkScxNCBVQ\n-------------------------------------------------------------------\nEntry: 150 kr (Limited amount Early Bird ticket on sale for two weeks only) / 180 kr in normal pre-sale / 200 kr at the door!\nTickets:\nhttps://bit.ly/48knVAz",
            "genre": "western/black/metal",
            "url": "https://billetto.dk/e/e-947327/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Unto Others [US] + Special Guests: Terminalist + Archangel — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-01T20:00:00.0200",
                "endDate": "2024-08-01T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/662b64c292c6564b659e68f8/1715178190420/header-uo-use.jpg?format=1500w"
                }
            ],
            "body": "De fremadstormende amerikanske heavy-goth-rockere Unto Others rammer Stengade til deres første headliner show i Danmark. Hyper thrasher Terminalist og horror rockers Archangel sparker aftenen i gang!\nUnto Others:\nIt is truly heavy music’s sweetest spot to take the majesty and familiarity of its past and inject it with a fresh bout of creativity, a welcome jolt of musical bravery and an X factor that makes you believe this band could make a difference. With nods to timeless gothic rock, traditional heavy metal, arena-ready hard rock and all while never, ever pulling their punches, this is exactly what Portland, Oregon’s Unto Others (formerly Idle Hands) have been doing since their inception in 2017.\nThe band is the brainchild of singer songwriter Gabriel Franco (formerly of Spellcaster and Seventh Gate) and to truly understand Unto Others, one must step inside his shoes and walk his journey to this point. Having grown weary with the restrictive scene politics that come with playing in bands circumnavigating rock’s underground, Franco made the decision to take a stand, both with the world and himself, to be limitless in both his ambition and his creative endeavors. After completing the task of seeking out and recruiting like-minded conspirators, all roads left to this band. All roads lead to Unto Others.\nFollowing on from their globally critically acclaimed debut album Mana and its equally lauded prior EP, Don’t Waste Your Time, as well as successful tours wowing the audiences of King Diamond, Behemoth and more, there is no better showcase for this iron clad mission statement than on their upcoming sophomore album, Strength.\nFilled with festival sized riffing and boasting irresistible, inescapable vocal hooks by the truckload, it is a masterclass in showcasing the pinnacle of hard rock’s past and not so much hinting at but screaming at a bright and bold new future. Be it the infectious gallop of “Why,” the effortless cool strut that emanates from “Downtown,” Gabe and Unto Others stared a global pandemic in the face and refused to be beaten into submission. Rather than allowing real world events to swallow them, they built a world of their own. An album that is true escapism.\nhttps://open.spotify.com/artist/1W5khHrkcznsyChxwIBfAI...\nhttps://www.facebook.com/untootherspdx/\nTerminalist:\nThe crises surround us—from the energy crisis and the war in Ukraine to inflation, inequality and deepening political polarization to the overarching climate and biodiversity crisis. Wherever we look, the world around us is engulfed in a state of crisis.\nIt is this weighty and complex theme that the Danish-American hyperthrashers in Terminalist take up on their sophomore album, 'The Crisis as Condition.' Rooted in 1980s technical thrash metal, they update the socio-political criticism known from the genre's heyday in the late ‘80s and early ‘90s—a time that was also characterized by political upheaval, yet marked by a belief in better times ahead.\nOn 'The Crisis as Condition,' this worldview is turned inside out. The optimism of earlier times and faith in progress have been replaced by a bleak and pessimistic realism.\nTransformation turns to turmoil; the state of emergency is the new normal. Crisis has become a condition.\nWhere the debut album, 'The Great Acceleration,' was a commentary on the (future) space race and the inherently destructive side of technology, 'The Crisis as Condition' is a\nsimultaneously detached and impassioned look at the present. Science fiction fantasies have been shelved in favor of a fierce analysis and castigation of contemporary crisis-ridden society. The future is not what it used to be.\nThis is expressed through hard-hitting and dynamic music rich in detail that has its basis in thrash metal, but which draws parallels to progressive metal and black metal with its intricate rhythms and ambitious songwriting. The lyrical references span far and wide—from Kreator to Margaret Thatcher—and draw on the works and thoughts of philosophers, sociologists, cultural critics, and political scientists such as Francis Fukuyama, Adam Tooze, Mark Fisher, Hartmut Rosa, Paul Virilio, and Mikkel Vedby Rasmussen.\nhttps://open.spotify.com/artist/5N4HmRQloswgMMTnnIHQmQ...\nhttps://www.facebook.com/terminalist/\nArchangel:\nEstablishing a skeleton of punk structures, songwriting, and raw energy influenced by acts such as Minor Threat, Good Riddance, AFI, Calabrese, Zombeast, the Offspring, Ramones, Blitzkid, The Lillingtons, and numerous others, and dowsing it with a quite literal heavy dose of Black Sabbath, Type O Negative, and, of course, all things Glenn Danzig, the band sets no boundaries for themselves and can range from being fast, melodic, even poppy, to soul-crushingly heavy.\n‘Total Dark Sublime’ – the debut album of Archangel that was released on October 20 2023, will seduce the listener with an energetic, aggressive metal-punk vibe, combined with huge arena rock choruses and memorable and catchy riffs.\nIn an inferno of blood, Archangel creeps both hard-hitting and melodic songs into the listener’s skull, like a murderous nightmare you will never wake up from again.\nhttps://open.spotify.com/artist/4Z4kqwNV2wjKpugWDJXKWK...\nhttps://www.facebook.com/archangelrock/\n------------------------------------------------\nEntry: 190 kr in pre-sale / 210 kr at the door!\nTickets:\nhttps://bit.ly/3JzIIWB",
            "genre": "heavy/goth/rock",
            "url": "https://billetto.dk/e/e-985770/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Sheer Mag [US] + Special Guests: The Guilt [SE] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-06T20:00:00.0200",
                "endDate": "2024-08-06T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65d22ae55af1895bbf272f89/1715599358016/header-sm.jpg?format=1500w"
                }
            ],
            "body": "Sheer Mags sensibilitet, som er lige så inderligt elsket af garagerockere og indie-børn, som den er af læder- og nitterloyale punkere, finder sin styrke i en utraditionel blanding af raffineret kompleksitet og ligefrem pop-dygtighed. Med sømløs handel mellem hoveddrejende guitar-helte spil og en charmerende tidløs blanding af disco, hård rock og garagebøjede hooks, har Sheer Mags ofte refererede, aldrig replikerede lyd spillet en unægtelig stor rolle i at stimulere den aktuelle genopblussen af powerpop fremadrettet rockmusik.\nKoncerten præsenteres i samarbejde med Killtown Bookings og Swamp Bookings.\nSheer Mag:\nSheer Mag have labored to carve out a discernibly singular position within the canon of contemporary rock: toggling with ease between the refined flourishes of a “connoisseur’s band” and the ecstatic colloquialism of populist songwriting—yet displaying no strict loyalty to either camp—their sound, while oft-referenced, is unmistakably and immediately recognizable as theirs alone. On\nPlaying Favorites\n, Sheer Mag’s third full-length and first with\nThird Man Records\n, the band capitalize on a decade’s worth of devotion to their own collective spirit—a spirit refined in both the sweaty trenches of punk warehouses and the larger-than-life glamour of concert halls—emerging with a dense work of gripping emotions, massive hooks, and masterfully constructed power-pop anthems.\nPlaying Favorites\nexpands with a sense of undeniable vitality, buoyed by rock and roll’s singular capacity to channel a relentless compassion for human life: as singer Tina Halladay puts it,\n“Nobody seems to write straight up rock bangers anymore—more than anything else, we want this record to put huge, catchy songwriting front and center.”\nThis is the record the Philadelphian rock and roll four-piece has always been destined to make.\nhttps://www.facebook.com/SheerMag/\nhttps://open.spotify.com/artist/58ehndX799ZV9Jcv6IefJ1?si=qyBDOW48ROafqUNeYk_FEw\nhttps://www.instagram.com/sheermagofficial/?hl=en\n+ Special Guests: The Guilt\nThe Guilt is electro riot grrrl punk from Malmö/Hässleholm, Sweden. No wave disco, electroclash, body punk, it could be many things but mostly it’s dancefloor anger management.\nAs sure as ever, fronting the band there is Emma Anitchka(vocals, machines, knives). In 2022 guitarist/bassist Lizzy(ex.Ragata, Arre Arre!) joined after previous band member Tobias left in 2021. Lizzy is known to be a shredding tornado on stage and a remarkable formula1 fact-teller off stage. Together they set a brutal tone for 2024. Think- Bikini Kill meets 2-Unlimited.\n﻿\n﻿In 2023 The Guilt released an EP on cassette “Note to Tape '' featuring three original songs but also heavy remixes by buddy-bands like GHLOW, ABU NEIN and 100BLUMEN. The sound of The Guilt has progressed into garage goth ballads as well as 80ties upbeat no wave punkbeats.\n﻿\n﻿The Guilt are cranking up the production speed to serve you queer anthems and songs about being a pretty basic witch. If you’d label your fave playlist “Goth riot grrrl electro”- this is for you. If you like to scream while dancing, this is for you!\n﻿\n﻿﻿\nhttps://open.spotify.com/artis...\n﻿\n﻿\nhttps://www.facebook.com/theguiltsweden\n--------------------------------------------------------------------\nEntry: 160 kr (Limited Amount Early Bird on sale until 29th of February 3pm) / 185 kr normal pre-sale / 200 kr at the door!\nTickets: https://bit.ly/4bErjJl",
            "genre": "rock",
            "url": "https://billetto.dk/e/e-950014/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Aland Z  — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-09T08:00:00.0200",
                "endDate": "2024-08-10T02:00:00.0200"
            },
            "openingHours": "08:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6645b40a8c601a0d49544a88/1716382165896/header-az.jpg?format=1500w"
                }
            ],
            "body": "Aland Z skaber et musikalsk univers til de misforståede gennem bragende popsange!\nAland Z:\nAland Z er hypermoderne, nytænkende og unik i pop genren, når han blander 00’ernes flamboyante lyd med hans kurdiske rødders toner. Med sin originalitet omfavner Aland Z et bredt felt af lyttere og baner vejen for en ny måde at være pop artist på. Temaerne i hans tekster tager udgangspunkt i den lange vej han har gået for at få lov at være sig selv - herunder findes elementer af ensomhed, eksklusion og diskrimination. Og netop det gør Aland Z op med, ved at skabe et musikalsk univers med plads til alle.\nI 2020 udgav Aland Z sin debut single ‘Shells’ som fik over 1.3 million streams på Spotify, hvilket medførte en stor opmærksomhed på den spirende artist. Siden da har Aland Z brugt alle døgnets timer på musikken, gennem sit forløb på den prestigefyldte skole Danish Songwriting Academy samt i studiet med hans producere som blandt andet består af Brandon Beal og Mikkel Broch-Lips.  Han har perfektioneret sit liveshow gennem diverse optrædener på blandt andet Uhørt\nFestival, ORAs AuditionDays, DPAs kegleaften 2022, RUST, og Villa Kultur. I sommeren 2023 tog Aland Z på tour som korsanger for Drew Sycamore og ser nu frem til en sommer 2024 hvor han skal synge kor for Malte Ebert.\nMed nye stærke sange i baghånden er Aland Z klar til endnu engang at byde velkommen ind i hans legende, energiske og performative musik.\nhttps://open.spotify.com/artist/5ac27Tra29pdLsxOZRddjm?si=2GTh2DRqSHGSDwmZlVpUcQ\nhttps://www.facebook.com/alandzmusic/\n+ Support: TBA\n————————————————————————————————————————————————-\nEntry: 80 kr (limited amount early bird ticket on sale until 6th of june / 110 kr in pre-sale / 125 kr at the door!\nTickets:\nhttps://bit.ly/4dFfFPn",
            "genre": "pop",
            "url": "https://billetto.dk/e/e-997268/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Exelerate + Spheres [FR] + The Vision Ablaze — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-15T20:00:00.0200",
                "endDate": "2024-08-15T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/660d431b501378587d18795f/1715178571144/header-stvae.jpg?format=1500w"
                }
            ],
            "body": "Kom med til et brag af en metal aften med alt fra prog, post, heavy metal, thrash og melodic mødes i en trekløver hvor Exelerate, The Vision Ablaze og franske Spheres spiller.\nSpheres\n:\nFounded in December 2017 by singer, guitarist and composer Jonathan Lino with Jesse Haddad on drums, Clémence Santé on bass and Marco Walczak on guitar, SPHERES is back in the forefront of the scene to make you discover their new album: Helios. Their Release Party at L’International, Paris, has been sold out and during this Tour they performed, among others, at Hellfest Off and Ready For Prog Festival. They opened for band such as Threshold, Freak Kitchen, Hangman’s Chair… This summer, they will be playing at Malmöfestivalen in Sweden as part of their European tour that includes shows in Belgium, Germany, Denmark, Sweden and their home country, France.\nIf the invitation to spiritual journey and dystopia seem to be the main dimensions of SPHERES, What strikes the listener is the multitude of contrasts and textures that inhabit their music: From sharp riffs to ethereal melodies, from clean singing to\ngrowls and screams, the atmosphere oscillates between dream and frenzy…\nEverything is designed to push the listener’s boundaries and invite them to take part\nin this journey.\nPROG METAL / HEAVY METAL / POST METAL\nFor Fans of : Gojira, Tool, Opeth, Mastodon, The Ocean, Devin Townsend\nhttps://www.facebook.com/bandspheres/\nhttps://linkr.bio/spheresband\nExelerate\n:\nExelerate plays a mix of Power and Thrashmetal with aggressive guitar and powerful vocals. Exelerate combines the sound of fast, aggressive riffs and virtuosic guitar solos with classic power-inspired vocals, which together create a new but recognizable type of metal.\nThe band's strength lies in their combination of their individual musical influences - this creates a cool mix of trash, power and prog metal that together add up to an aggressive yet accessible sound. Exelerate really knows how to start a show, and they give the audience an explosive experience that contains everything that metal entails, so you can look forward to a blast of metal party!\nhttps://www.facebook.com/Exelerateband/\nhttps://open.spotify.com/artist/0jRw54h5J5HeIkexDiOHZC?si=aOWMnnHPQVKnf58mL3U2bA\nThe Vision Ablaze:\nCopenhagen-based melodic metal act, THE VISION ABLAZE, set the metal scene ablaze with their sophomore album, 'Embers', in 2022. Fronted by the charismatic Tim Nederveen, the band embarked on a journey of sonic reinvention, infusing their sound with modernity and a heightened sense of brutality, while maintaining their signature haunting melodies.\nSince the scorching release of 'Embers', THE VISION ABLAZE has continued to captivate audiences with their energy and style. Their latest offering, the EP ‘Visions’ features three dynamic tracks, including a daring cover of Radiohead's \"Street Spirit\". This EP delves deeper into the band's sonic exploration, offering a glimpse into their evolving musical landscape.\nWhile 'Embers' showcased the band's ability to blend aggression with epic, emotionally charged compositions, ‘Visions’ builds upon this foundation, delving into darker territories while still retaining their melodic allure. With each track, THE VISION ABLAZE demonstrates their commitment to pushing the boundaries of melodic metal, offering fans a tantalizing taste of their evolving sound.\nRecorded and produced by the band's own Lars Lerager, the EP serves as a testament to THE VISION ABLAZE's continued evolution and unwavering dedication to their craft. Keep your ears to the ground as they continue to blaze new trails in the realm of melodic metal.\nhttps://www.facebook.com/thevisionablaze/\nhttps://open.spotify.com/artist/233Rk7JDJ4E67M3wWsMOFJ?si=BRN8qxiQR4yMe4DT8OUnew\n-------------------------------------------------\nEntry: 105 kr in pre-sale / 120 kr at the door!\nTickets: https://bit.ly/4am5ux2",
            "genre": "metal",
            "url": "https://billetto.dk/e/e-970022/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Dopethrone [CA] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-16T20:00:00.0200",
                "endDate": "2024-08-17T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65c08e9c59e3477a33aa9889/1715178678952/header-dopethrone.jpg?format=1500w"
                }
            ],
            "body": "Det bliver tung sovset doom og \"slutch\" aften når Kanadiske Dopethrone besøger Stengade til August!\nDopethrone:\nDopethrone is a three piece band from Montreal, Quebec, Canada. Active since 2008, this DIY band encompasses the bleakness of black metal, the steadfastness of New Orleans-style sludge, and a heavier-than-thou doom mentality. The riffs are thick, punishing, suffocating and destructive, with lyrics based in self-destruction, murder, cannabis and sleazy drug abuse. The band refers to their music as “Slutch”, the canadian term for cold sludge, a.k.a dirty mud snow. They once described it as “frozen sludge, snow covered in crackhead diarrhea, blood, tears and broken dreams”.\nAfter their second release, the band started drawing some attention to them and were invited by Voivoid at Roadburn 2012. They since haven’t stopped growing their audience in Europe, their adoptive land. Since their formation Dopethrone has released five full length studio albums to date, joined some collaborations with other artists and have regularly toured Europe and Canada. After a series of massive tours in 2019, the band has not hit the road since, and focused on the “delicate” baking of their new release. The new effort, to be out early 2024, will come with some North America tours and only a handful of European shows.\nhttps://www.facebook.com/dopethrone.mthell/\nhttps://dopethrone.bandcamp.com/\n+ Support: TBA\n-----------------------------------------\nEntry: 155 kr (limited amount early bird ticket offer until 29.02.24) / 175 kr in normal pre-sale ﻿/ 190kr at the door!\nTickets:\nhttps://bit.ly/3vTBeKy",
            "genre": "stoner/metal",
            "url": "https://billetto.dk/e/e-937754/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Fen [UK] + Special Guests: Lysbaerer + Heksproces — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-17T20:00:00.0200",
                "endDate": "2024-08-18T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65df24833499f620fe88b518/1715178748206/header-fen.jpg?format=1500w"
                }
            ],
            "body": "Træd med ind i mørket når britiske Fen besøger Danmark for første gang med deres atmosfæriske post black metal og spiller Stengade sammen med Lysbaerer og Heksproces!\nFen\n:\nThe colour of every FEN album points towards its lyrical and musical content. For the first time in their career, the East Anglian post-black metal trio has used the colour red on the cover artwork of their seventh full-length \"Monuments to Absence\". FEN describe the album as an expression of anger, hopelessness and despair – anger at the desperate futility of a human species hell-bent on self-destruction. This is reflected in the decidedly harsh and black sound of \"Monuments to Absence\", which is undoubtedly FEN's most extreme recording to date, even though there are still moments of atmospheric glory, spatial clean sections, heaving doom, and full-blown riffs, which augment the furious expression of rage. FEN took their name from the Fens of East Anglia when the trio formed in 2006. These desolate and bleak landscapes have left a deep mark in the post-black metal sound, which the band pioneered in the UK when the English scene revitalised in the wake of forerunners FOREFATHER with bands such as FEN, WINTERFYLLETH, and WODENSTHRONE coming to the fore. When FEN released their debut full-length \"The Malediction Fields\" (2009), the band made good on the huge promise of their previous EP \"Ancient Sorrow\" (2007) by delivering a first album that already combined the black metal tradition elegantly with a dedicated atmospheric twist and gentle experimentation beyond the perceived narrow confines of their genre. With each following full-length, from \"Epoch\" (2011), via \"Dustwalker\" (2012), \"Carrion Skies\" (2014), \"Winter\" (2017) to \"The Dead Light\" (2019), FEN have expanded both their musical range and following, while also perfecting their recognisable and unmistakable sound. \"Monuments to Absence\" marks FEN's welcome return to a dark and fierce sound.\nhttps://www.facebook.com/fenofficial/\nhttps://open.spotify.com/artist/1MlFNDlH2naWutA9C0nNVB...\nLysbaerer\n:\n“Skyerne græder, som jeg har gjort..”\nEn sær blanding af depression, mørke, grandiositet og kosmisk kaos udgør LYSBAERERs univers. Værket “I: Som et lys i natten, må vi alle finde frelse..” er første del i en trilogi om at rejse mellem livet og døden. Værket besøger tematikker som frygt, mistillid og afsked; alt sammen blandet sammen i massive vægge af lyd. Musikken er lavet med tanken at bearbejde følelser og det at kæmpe kampe, både indre, såvel som ydre, hvilket er udtrykt i tekst, og så vidt muligt ud af musikken lige så.\nLYSBAERER er en duo bestående af Jamie de la Sencerie og Thomas Mascagni. Bandet blev dannet med et ønske om at have kreativ frihed til at skrive den musik som inspirerer os. LYSBAERER er beskrevet som post-blackmetal da ønsket for bandets lyd er at have den voldsomme kant som blackmetal har, men samtidig have et ønske om at skubbe det andre steder hen end blot den klassiske blackmetal lyd. LYSBAERER er inspireret af bands som Wiegedod, Wolves In The Throne Room, Groza, Panopticon, Ellende og White Ward.\n“I: Som et lys i natten, må vi alle finde frelse..” er blevet mixet og masteret af Christoffer Hildebrandt og cover-grafikken er lavet af Simon Kofoed. Jamie spiller guitar og bas, Thomas spiller guitar, skriver trommer og laver vokal på ovenstående værk.\nLYSBAERER arbejder ud fra en do-it-yourself tankegang, med hjælp fra mennesker med tætte relationer til bandet. Da grundstenene for bandet er en duo, er der fundet en live besætning som vil hjælpe med at bringe musikken til livs.\nhttps://www.facebook.com/lysbaerer\nhttps://www.instagram.com/lysbaerer.band/\nHeksproces\n:\nHeksproces er et nyt, ambitiøst navn på den danske metalscene. I november udkom debut-EP’en ‘Ligblomst’ masteret af Simon Sonne fra ORM, og i december blev de kåret til “Årets Nye Danske Navn” af Devilution. Siden dannelsen i København i starten af 2022 har de med afsæt i postmetallen udforsket lyden af undergang fra en fjern sump ved den menneskelige civilisations grænse. Lyden er tung og aggressiv, men rummer også følsomme og melodiske elementer i de ofte lange, organiske kompositioner.\nSelvom Heksproces er nyt, blev bandets rødder lagt helt tilbage i 2011 i en lille fugtig kælder under en bornholmsk folkeskole. Her mødtes en flok teenagedrenge, der sammen udviklede en livslang glæde for knusende guitarriffs og skæve taktarter. Et årti og mange timer i øvelokalet senere er kærligheden til metallen ikke blevet mindre, og nu er de fire heksedoktorer klar til at kaste mørke besværgelser over den københavnske undergrund.\nHeavymetal.dk skriver: “De rammer melankolien i deres black-metal momenter utroligt godt, og deres post-metal segmenter har også den rigtige vægt og tunghed”.\nDevilution skriver “De tog røven på mig med okkult stemning, progget bevægefrihed, blacket bidskhed og poetisk vovemod. Her er potentiale til noget virkelig substantielt\"\nhttps://open.spotify.com/artist/4ai0mAU3wlJzyO62z3C9qU...\nhttps://www.facebook.com/heksproces\n-------------------------------------------------\nEntry: 130 kr (limited amount early bird ticket on sale until 20th of march or sold out) / 150 kr normal pre-sale / 165 kr at the door!",
            "genre": "post/black",
            "url": "https://billetto.dk/e/e-959133/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "W.I.T.C.H. [ZM] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-21T20:00:00.0200",
                "endDate": "2024-08-21T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/661652de3660915484794aa4/1715178816723/header-witch.jpg?format=1500w"
                }
            ],
            "body": "Vi glæder os til at byde legendariske W.I.T.C.H. velkommen på Stengade til en aften af Zamrock!\nFor fans af: Goat, Kikagaku Moyo, Wand, Thee Oh Sees, Mdou Moctar.\nObs. billetsalg starter fredag d.12 april kl:11\nW.I.T.C.H. (We Intend To Cause Havoc) were the biggest rock band in Zambia in the 1970s and spearheaded a new genre dubbed Zamrock, fusing influences that ranged from the Rolling Stones to Black Sabbath and James Brown and mixing them with traditional African rhythms and bush village songs. At t the peak of their popularity, the band often needed police to keep fans at bay while their lead singer Jagari - whose name is an Africanisation of Mick Jagger’s - riled up crowds by stage diving from balconies and dancing manically as the WITCH’s blend of psychedelic rock and African rhythms permeated the surrounding atmosphere.\nJagari is the charismatic sole surviving original member of the band. As Zambia’s economy stagnated and the country buckled under the AIDS crisis, WITCH fell apart. Jagari retreated to a life of quasi-anonymity as a university music professor before being wrongfully arrested during Zambia’s toughest hour. Now a man in his 60s, he spends his time mining gemstones hoping to strike it rich, until very recently the band being just a nostalgic memory of his youth.\nLargely unknown outside of their home country, WITCH finally got the exposure they deserved when Now Again Records reissued their entire discography in 2012. This allowed Jagari to play outside Africa for the first time and for a new generation of fans to discover his music. In 2016 he began a collaboration with Dutch musicians Jacco Gardner and Nic Mauskoviç, and together with them, in September 2017 WITCH headed out on its extremely successful first-ever European Tour. In the Fall of 2019, WITCH embarked on their first North American tour. They return to the states including this show at The Drake on 10/9 following the screening of the documentary at the Amherst Cinema on 9/7.\nhttps://weintendtocausehavoc.com/\nhttps://open.spotify.com/artist/0LMkPoi2xIgpOPUSJMftqM?si=5O7KBXW-SnKwNsOPkA06dw\nhttps://www.instagram.com/weintendtocausehavoc/?hl=en\n--------------------------------------------------------------------\nEntry: 200 kr (limited amount early-bird ticket on sale until 01st of May or sold out) / 220 kr in pre-sale / 240 kr at the door!\nTickets: https://bit.ly/43DRAE5",
            "genre": "zamrock",
            "url": "https://billetto.dk/e/e-974718/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Cobra Spell [INT] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-23T08:00:00.0200",
                "endDate": "2024-08-24T02:00:00.0200"
            },
            "openingHours": "08:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/664da5187b4bc53cc92ee15a/1716365280487/header-cs1.jpg?format=1500w"
                }
            ],
            "body": "Det bliver 80'er rock og heavy metal centreret om kærlighed, sex og rebellion når Sonia Anubis's (Ex. Crypta, Ex. Burning Witches) nye band Cobra Spell rammer Stengade til August!\nCobra Spell:\nCOBRA SPELL aims for world domination with their devilish 80s metallic rock inspired debut, 666! International sleaze rock quintet COBRA SPELL strike with their debut album, 666, out December 1, 2023 via Napalm Records!\nFounded in 2019 by up-and-coming guitar phenomenon Sonia Anubis (ex-CRYPTA, ex-BURNING WITCHES), the band’s current lineup is completed by Kristina Vega on vocals, Twitch Streamer Noelle dos Anjos on guitar, Hale Naphtha on drums and Roxy Herrera on bass. Together they have already toured with numerous established bands such as ROSS THE BOSS, ENFORCER and EVIL INVADERS, and released two globally praised EPs, Love Venom (2020) and Anthems Of The Night (2022). With these aces under their studded leather belts, COBRA SPELL now introduce their first full-length, aiming for nothing less than 80s rock ‘n’ roll world domination.\nA heavily classic rock inspired intro track paves the way for the energetic first single “S.E.X.”, which is centered around Kristina Vega’s sky-high vocals. The essence of 666 is without a doubt untamable and unapologetic feminine power, refreshingly twisting typical lyrical themes of 80s sleaze metal – particularly present on tracks like “Satan Is a Woman”\nand “Bad Girl Crew”. COBRA SPELL don’t limit themselves to glam rock and heavy metal clichés with their instrumentation either – from tingling synths to a groovy saxophone solo on “Love = Love”, the band skillfully combines different 80s-inspired soundscapes. COBRA SPELL’s songwriting skills especially shine on catchy future hit “The Devil Inside of Me” and emotional “Fly Away” – the latter representing one of the slower songs on the album. Mesmerizing melodies and absorbing drum patterns are topped off by raspy rock ‘n’ roll vocals on the W.A.S.P.-inspired anthem of runaways and rebels, “Warrior From Hell”, before shredding “High on Love” wraps the album up on an uplifting note. COBRA SPELL’s ambitious, smoking hot debut attack, 666, showcases the undisputable talent of the outfit, and is sure to settle the rising rockers’ standing in the scene.\nThese fierce ladies take no prisoners and are now ready to take on all stages worldwide, with a hunger to put on a show that will leave audiences around the globe bewitched, speechless and begging for more.\nhttps://www.facebook.com/cobraspell/\nhttps://open.spotify.com/artist/4UrOQcsh8WvcWpugasHJCM?si=sDSweflqRry1v6NV_pGQ-w\n+ Support: TBA\n---------------------------------------------------------\nEntry: 160 kr in pre-sale / 180 kr at the door!\nTickets: https://bit.ly/3K8l6ZF",
            "genre": "heavy/metal",
            "url": "https://billetto.dk/e/e-1006399/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "The Luna Riot Ball Vol.6 - Motörqueens [IT] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-24T19:00:00.0200",
                "endDate": "2024-08-25T14:00:00.0200"
            },
            "openingHours": "19:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/66026fa8cc850700c2b87057/1715178888372/EVENT+UDEN+STJERNE.jpg?format=1500w"
                }
            ],
            "body": "The Luna Riot Ball Vol.6 – Skate Session.\nFilthy and Free, for Equality and Supporting Minorities.\nBlågårdsplads 13 - 19\nSkate session in collaboration with It´s Obviously.\n3 concerts and DJs.\nThis year we will also have a creative art flea market and other surprises.\nAfter Party at Spillestedet Stengade 19-02\nFood truck.\n2 concerts.\nLineup: Motörqueens + TBA\nMotörqueens: Motörqueens is the first and unique female tribute to Motörhead over Europe.\nhttps://www.facebook.com/motorqueens\nSkate movie on the first floor, setup by Its Obviously.\nTombola and a tattoo both.\nSavage DJ Dance Party.\nThe Luna Riot Ball Vol. 6 Cassette Tape Release.\nWe celebrate fierceness! And that your gender doesn’t define how much you can fill up the room, how wild, loud, squealing, dirty, primitive, raw you are!\nThe association The Luna Riot Ball, is a feminist rock festival, it focuses on creating events that has a safe venue for women, transgender and non-binary people who have a place in the rock music environment.\nNO RACISM. NO SEXISM. NO HOMOPHOBIA/HETEROSEXISM. NO VIOLENCE. NO HARD DRUGS.\nSkater girl art by Pinche petra",
            "genre": "the/luna/riot/ball",
            "url": "https://billetto.dk/e/e-972366/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "barejegvarmig — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-08-31T20:00:00.0200",
                "endDate": "2024-09-01T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/664330a52f9167454c02f14d/1715681320930/stengade-bjvm4.jpg?format=1500w"
                }
            ],
            "body": "“barejegvarmig” leverer catchy, autentiske, og ærlige fortællinger på lyd og video serveret med glimt i øjet og et twist af poesi, mystik og quirkyness.\nHvad enten det er er på scenen, gennem musik udgivelser eller via visuelt content så er den røde tråde for projektet “barejegvarmig” formidling af historier, både dem fra det virkelige liv, og dem der er brygget på en livlig fantasi.\nMålet for projektet er at bringe noget nyt til bordet, tænke ud af boksen og gør op med med den gengse måde at være artist på i danmark.\nDet har på projektets korte levetid resulteret i en stor følgereskare på over 10.000 følgere på tværs af SoMe platforme som Tiktok, instagram og Facebook.\nhttps://www.instagram.com/barejegvarmig/\nhttps://www.facebook.com/profile.php?id=61555732500302\nhttps://open.spotify.com/artist/2jd9z4iry5iB6Ue1pt6HVH...\n-------------------------------------------------------------------------\nEntry: 110 kr (limited amount early bird ticket on sale until 14th of june) / 130 kr in normal pre-sale / 145 kr at the door!\nTickets:\nhttps://bit.ly/3UTihlf",
            "genre": "alt/pop",
            "url": "https://billetto.dk/e/e-995509/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Deeper [US] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-09-12T20:00:00.0200",
                "endDate": "2024-09-12T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6635ff8222452529e8cf34c0/1715679994307/header-deeper.jpg?format=1500w"
                }
            ],
            "body": "Det bliver en indie rock post punk aften med amerikanske Deeper som netop har turneret med Depeche Mode.\nDeeper:\nYou can’t get Deeper if you’re standing still. That’s intentional, says the Chicago quartet’s Nic Gohl. “Does it feel good when you’re listening to this song? Does your body want to move with it?” These are the questions he asked himself as he and bandmates Shiraz Bhatti, Drew McBride, and Kevin Fairbairn were writing and recording Careful!, their third record and Sub Pop debut. “I wanted these to be interesting songs, but in a way where a two-year-old would vibe out to it,” Gohl adds. “It’s pop music, basically.”\nThat “basically” qualifier is working pretty hard, as fans of 2020’s Auto-Pain might suppose. Auto-Pain was an album of thick brutalist architecture, full of straight lines and sharp angles, making hard shapes strong enough to carry a heavy thematic burden. On Careful!, they’re reshaping the facades and splashing color, not reimagining their sound so much as testing its limits. There are synth experiments, there are moments of nauseatingly powerful darkwave and coldbeat. There are massive rock’n’roll songs that you can imagine 10,000 people singing along to in some beautiful outdoor setting. There is a remarkably moving love song. Is there pop? There’s some pop, yes, a wiry bit of Cars-esque neon called “Everynight.” Look around the right corners, and you might see some of the old buildings peeking through, too, but in this context—on a song like “Sub,” say, a song that began life as a slow and dark prog jam but is now an elegantly cresting wave of post-punk—they feel more sophisticated, lit up in the cold, bright glow of Television.\nAuto-Pain was released in March 2020, which means Deeper wasn’t able to play their new album live for nearly a year and a half. “It was hard living in the vacuum of depending on Spotify numbers to quantify what your music means to other people,” McBride says. Nature abhors a vacuum, though, and the band rushed to fill not only their empty time but the suddenly empty idea of what, exactly, their identity was. “Isolated by ourselves, we were like, ‘What is Deeper?’” Bhatti says. “We’ve always talked about how we didn’t want to stay in one genre as a band,” Gohl says, and absent any audience expectations, they gave themselves the freedom to tinker.\n“One vibe I thought about a lot was Bowie’s most coked-out productions,” Gohl says. If you want to, you can hear echoes of Low in the snapping rhythm and gray-sky synths of “Tele,” but you can also hear a bit of Auto-Pain in the nailed-in, stippling lines being spit out by Bhatti’s drum programming and McBride’s synthesizer. “Fame” seems to stumble together and nearly fall apart, the dialed-up noise making the beat feel maniacal and a little invincible, the whole thing a series of short, snipped, autonomous gestures that are by now Deeper’s trademark.\n“Build a Bridge” pushes in the opposite direction, using a prickly guitar line to launch into big, smeary art-pop, its emotional palette clear, well-defined, and easy to latch onto. On “Sub,” Gohl sings above and below the melody like Ian McCulloch, bellowing and wondering and ruminating and rounding into swaggering confidence that the band rises to meet. It’s festival headliner music that still feels like it was written in a garage.\nThe album’s title, exclamation point, and all come from the song “Airplane Air,” and it’s echoed in the album’s final song, “Pressure,” a song Gohl wrote for his wife and longtime partner. “Be safe,” he sings, “I will need you around.” It’s a song that sounds like nothing else in their catalog—ringing harmonics, chiming chords, vocal harmonies—but the sense of interdependence is near the center of Deeper’s music, from the way Gohl and McBride’s guitars jigsaw together and interlock with Bhatti’s drum patterns and Fairbairn’s bass to the lyrical vulnerability at the album’s core. That sense of mutuality makes this restlessly curious, stylistically broad album feel like the most coherent portrait of who Deeper is. Or, as McBride ultimately frames it, “Careful! is about looking out for one another.”\nhttps://www.deeperchi.com/\nhttps://www.facebook.com/deeperchi\nhttps://www.instagram.com/deeper.band/\nhttps://deeperchi.bandcamp.com/\n+ Support: TBA\n-------------------------------------------------\nEntry: 155 kr in pre-sale / 175 kr at the door!\nTickets:\nhttps://bit.ly/3JIeAZa",
            "genre": "indie",
            "url": "https://billetto.dk/e/e-988953/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Nana Jacobi + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-09-13T20:00:00.0200",
                "endDate": "2024-09-14T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6620e02179e6633c82ca367a/1715680129954/header-nj.jpg?format=1500w"
                }
            ],
            "body": "Nana Jacobi har ry for at være en bjergtagende og publikumsinvolverende live-performer. Hun går på scenen med et dynamisk og stærkt liveband i ryggen, og leverer både høj energi og dansable momenter, samt mere nærværende, intime møder med sit publikum.\nSangen ‘Hold Dit Hjerte Blødt’, udgivet med Annika Aakjær og Jeanett Albeck featuring, er blevet kaldt “en nyklassiker” og den er naturligvis med på sætlisten, sammen med andre af Jacobi’s store\nsange fra hendes nyere bagkatalog, samt fra film- og tv-soundtracks. \"Nana Jacobi på SPOT Festival 2023 var en ud-af-kroppen-oplevelse – En oplevelse, hvor hun igen slog fast, hvilken stjerneartist og musiker hun er.” Bands of Tomorrow 2023.\n“Gennem de 35 minutter er der konstante overraskelser. Intet står tilbage som statisk. Publikum er med på rejsen. De er i hjertet af det hele” GAFFA 2023.\nJacobi har udgivet fem album og en EP i eget navn, samt skabt musik og sange til film og tv. Med albummet ‘Magnet Sky’ (2021), og ‘Elvira Sange’ (sange til tv-serien Elvira, Viaplay 2022) fik\nJacobi for alvor fat i et større publikum. Jacobi startede derfor 2023 flyvende; på forsiden af Danmarks største musikmagasin GAFFA.\nVed SPOT Festival samme år leverede hun én af de koncerter der blev ‘talk of the town’, og overhældt med stjerner af begejstrede anmeldere. Senere på året blev hun tildelt medlemskab af\n‘Dansk Rock Akademi’ med ordene: “Livsvarigt medlemskab tildeles i anerkendelse af den indsats og betydning, du har haft for udviklingen af musik og musikliv i Danmark”.\nNana Jacobi fik sit gennembrud for år tilbage, med sangen ‘Open Sky’ fra filmen ‘En Kort, En Lang’. En sang som fik en slags evergreen-status på P4, og stadig spilles den dag i dag. Nana\nJacobi er desuden kendt som medstifter af og direktør for musikprojektet HUN SOLO - koncertvirksomhed og label for kvinder og kønsminoriteter i dansk musikliv. Herudover er Jacobi\nen aktiv stemme i det danske debatlandskab.\nhttps://www.facebook.com/nanajacobi/\nhttps://open.spotify.com/artist/7GEbIq8gkH059rXhvf6GDK...\n-------------------------------------------------\nEntry: 155 kr in pre-sale / 175 kr at the door!\nTickets:\nhttps://bit.ly/3vLBL1G",
            "genre": "electro/pop",
            "url": "https://billetto.dk/e/e-982262/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Midnight Danger [SE] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-09-14T20:00:00.0200",
                "endDate": "2024-09-15T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/663b3a4f0f42e02e3a6b701e/1715179156001/header-md3.jpg?format=1500w"
                }
            ],
            "body": "Det bliver en aften fyld med synthmusik, 80'er-metal og klassisk horror. Midnight Danger er en nostalgisk soundtrack-oplevelse fuld af synthesizere og guitarriffs, der leverer masser af power, punch og retro-vibes.\nFFO: Ollie Wride, Dance With The Dead, Carpenter Brut, The Midnight, Perturbator,\nMidnight Danger:\nHailing from Stockholm, Sweden, rising star Midnight Danger brings an electrifying fusion of influences to the music scene. Conceived by producer and guitarist Chris Young in late 2015, this music endeavor draws inspiration mainly from synthwave music, '80s metal, and classic horror. Midnight Danger crafts a nostalgic soundtrack journey with pulsating synthesizers, driving rhythms, and a cinematic essence that instantly transports listeners back to the era of neon lights, arcade games, and VHS\ntapes. While evoking a sense of nostalgia for the 1980s, their tracks also add modern production techniques to create a unique fusion of old and new.\nWith three full-length albums, numerous singles, and a trail of sold-out physical albums, Midnight Danger's music has resonated worldwide, garnering millions of plays and streams. Also renowned for captivating live performances, Midnight Danger has built a legacy with a string of shows across Europe, North America, and South America throughout their career.\nAs of 2024, the highly anticipated Endless Nightmare Tour is finally making its way to Europe, with 16 electrifying shows scheduled across multiple countries.\nhttps://www.facebook.com/MidnightDanger/\nhttps://open.spotify.com/artist/08oYIzltKqFzeg7pQg6hh4...\nhttps://www.instagram.com/midnightdanger/\n--------------------------------------------------\nEntry: 155 kr in pre-sale / 175 kr at the door!\nTickets:\nhttps://bit.ly/3Uxz2B7",
            "genre": "synthwave",
            "url": "https://billetto.dk/e/e-992862/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Austere [AU] + Support: Skuggor [SE] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-09-21T20:00:00.0200",
                "endDate": "2024-09-22T14:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65fbf2bd9c60044fa3ff7f30/1717139306154/header-austere.jpg?format=1500w"
                }
            ],
            "body": "Australske Austere er tilbage efter 13 års pause og i den anledning skal de til Europa hvor de gæster Stengade og Danmark for første gang!\nAustere:\n\"Beneath the Threshold\" represents AUSTERE in the here and now. With their fourth full-length the Australians have taken a long step into the present and embrace their musical future in a way that might have been expected after a 13-year hiatus.\nWhen their voluntary break ended with the release of \"Corrosion of Hearts\" in 2023, the duo consisting of Mitchell Keepin and Tim Yatras returned with a more mature and defined version of their own particular style of black metal, which reflected both their greater experience and evolution as artists. Both musicians had been active in other bands during the hiatus of AUSTERE.\nWhile \"Corrosion of Hearts\" formed the bridge between the band's musical history and the artists' fresh vision, \"Beneath the Threshold\" takes a leap of expression. AUSTERE's sonic heritage is still alive. Even though their roots in early Norse black metal and its depressive Scandinavian offspring continue to shine through, it is also apparent that the Australians have audibly strengthened their emotional expressiveness and previous blackgaze leanings beyond the point where a stylistic shift towards the latter needs to be diagnosed.\nOn \"Beneath the Threshold\", AUSTERE offer more hooks and melodic harmonies to complement the multi-layered, harsh and dreamlike guitar textures expertly woven by Keepin with the aid of Yatras' emotive drumming. This development is emphasised by a suitable production that lets each of the elements shine and does not try to blur the riffs.\nhttps://open.spotify.com/artist/7gyVPCoE80rSyEW6yuJ6HM?si=eh1vVCuDRiK4oHnKCX4vxg\nhttps://www.facebook.com/OfficialAustere\nhttps://www.instagram.com/official_austere/\n+ Support: Skuggor\nSkuggor:\nSkuggor is an ambient Black Metal band based in Sweden. Their second album \"Whispers of Ancient Spells\" was released in March 2024 by Naturmacht Productions.\nWith Whispers of Ancient Spells Swedish-based one-man project Skuggor invites listeners to traverse realms of darkness, mist and myth. Guided by the hypnotic melodies that echo through the corridors of ancient forests, each track is a chapter in exploring shadows of the past.\nhttps://skuggor.bandcamp.com/\n---------------------------------------------------------\nEntry: 125 kr (limited amount early bird on sale until 4th of April or sold out) / 150 kr normal pre-sale / 170 kr at the door.\nTickets: https://bit.ly/3TLfzO7",
            "genre": "depressive/black/metal",
            "url": "https://www.stengade.dk/show/2024/9/21/austere-au-support-tba",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Ozric Tentacles [UK] + Support: Silas & Saski [UK] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-09-27T20:00:00.0200",
                "endDate": "2024-09-28T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/65db22b8d9f3190c55d76730/1715179566901/header-ot.jpg?format=1500w"
                }
            ],
            "body": "Det bliver en syret rejse når legenderne i Ozric Tentacles spiller på Stengade til september!\nOZRIC TENTACLES\nOzric Tentacles are regarded as one of the most influential bands to emerge from the UK’s festival scene, formed during the solstice at Stonehenge Free Festival 1983 going on to become psychedelic staples at Glastonbury and other festivals. The creative vision of multi-instrumentalist Ed Wynne, the Ozrics’ uniquely trippy soundscapes connect fans of progressive rock, psychedelia and dance music culture.\nIn the 1980s the band built a fan base on the festival circuit and made a series of cassette releases, sold at gigs and via a fan club. Their first label release was Pungent Effulgent in 1989, which was also re-released in the early 2000s, packaged with Strangeitude. This was followed by Erpland (1990), an album dedicated to Erp, a character who appears on many of the band's album artworks. 1991 saw the Strangeitude LP. The track \"Sploosh!\" was used by BMW in an advertising campaign and became the band's only single. By 1993 the band had grossed over three million dollars, and their Jurassic Shift album reached the top ten of the U.K. album charts.\nThe band has gone through many line-up changes, with only Ed Wynne (guitar and keyboards) maintaining a constant presence. The sonically illustrated excursion through the musical realms the band have explored has resulted in 17 albums to date, with their latest, Lotus Unfolding, released in their 40th anniversary year. The band maintain their identity and continue to tour worldwide and produce intriguing albums.\nOzric Tentacles are:\nEd Wynne: Guitars / Keyboards\nSilas Wynne: Keyboards\nVinny Shillito: Bass\nPat Garvey: Drums\nSaskia Maxwell: Flutes / Modular Synth\nhttps://open.spotify.com/artist/0Iv00ucAIqr5KVS7bXGFa9...\nhttps://www.facebook.com/OfficialOzricTentacles\n+ Support: Silas & Saski\nSilas & Saski unite in a songful blend of transcendental harmony and innocent beauty, merging musical worlds to form a new super breed of ethereal Space Folk. With a heightened sense of vision, they are climbing to new vistas of awareness through the medium of music.\nSilas Neptune is a unique musician known for his role as synth player for the influential psychedelic rock band Ozric Tentacles. His solo album The Scales of Tahuti released in 2017, is a journey through far off dreamscapes and an exploration of the cosmos.\nSaskia Maxwell is a singer, guitarist and flautist from another realm. Growing musically through a world of folk, Saski tells secrets and timeless tales with songs that explore the esoteric side of nature and seek truth behind the illusion.\nSilas & Saski have released a stunning three track EP, The Power Of Three (Erpsongs, 2020) to great acclaim; the Progressive Aspect describing it is “relaxing and cleansing stuff … a real tonic in troubled times.”\nhttps://www.facebook.com/silasandsaski/\n----------------------------------------------------------------------\nEntry: 205 kr in pre-sale / 220 kr at the door!",
            "genre": "psychedelic/rock",
            "url": "https://billetto.dk/e/e-957927/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Inspector Spacetime [IS] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-10-04T20:00:00.0200",
                "endDate": "2024-10-05T02:00:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6639e9266db15e5a643034f1/1715680168999/header-is1.jpg?format=1500w"
                }
            ],
            "body": "Det bliver en dansefest når Islandske Inspector Spacetime besøger Stengade med elektronisk pop musik som tager inspiration fra Daft Punk, The Prodigy, Charli XCX og flere disco og synth pop acts.\nInspector Spacetime:\nInspector Spacetime is a Reykjavík based pop band, influenced by a wide variety of dance and pop acts and genres (notably Daft Punk, The Prodigy, Charli XCX along with disco and synth-pop classics). The band’s music is an ode to the European dance music scene throughout the decades, where the common goal is to get people moving.\nWith their self-titled debut album, Inspector Spacetime made waves in the Icelandic music scene in early 2020, receiving a nomination for album of the year at the Icelandic music awards, as well as an award for album of the year from the Kraumur awards and the title of artist of the year from The Reykjavík Grapevine music awards. Their music has been well received by notable critics from Iceland's national public-service broadcasting organization and audiences alike.\nInspector Spacetime has been a constant presence in Iceland since their emergence, as they strive to breathe life into the live-music scene in Reykjavík. They’ve made a name for themselves as one of the best live acts Iceland has to offer with their electric energy and carefree attitude. After careful expansion and evolution of their act, they’ve never been sharper.\nIn the last few years they have toured multiple Icelandic music festivals, including Iceland Airwaves, as well as playing in neighboring Scandinavia and in Germany, where they warmed up for Daði Freyr on the European leg of his latest tour.\nhttps://www.facebook.com/inspectorspacetimeband/\nhttps://open.spotify.com/artist/1okul7dptdA4OSaS7X6THG...\n---------------------------------------------------------------------\nEntry: 160 kr in pre-sale / 185 kr at the door!\nTickets:\nhttps://bit.ly/3UFHTlJ",
            "genre": "electronic",
            "url": "https://billetto.dk/e/e-988964/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Ellende [AT] + Groza [DE] + Servant [DE] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-10-06T20:00:00.0200",
                "endDate": "2024-10-06T23:59:00.0200"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6581730cf4ed514fd20a6605/1715180032061/header-ellende.jpg?format=1500w"
                }
            ],
            "body": "Det bliver mørk atmosfærisk og melodisk black metal aften når Ellende besøger Danmark for første gang!\n\"As promised we will do one tour in 2024 and with \"Scherben Tour\" our longest up to date is being announced. We'll visit many cities and venues never played before and we're happy to have our friends in Groza supporting as well as Servant opening.\" - ELLENDE\n\"We are excited to announce our next tour. We will bring the storm all over Europe in October 2024 in company of our comrades in Ellende and Servant. This tour will be in support of new yet unannounced music, to also be unveiled in 2024. Join us.\nOnwards!\" - GROZA\nEllende:\nEllende was founded in the year 2011 by L.G. as a soloproject and turned into a live-band with session musicians in 2012. His first outcome was a self-released digipack (100 pieces) named Rückzug in Die Innerlichkeit in 2012. The self-titled debut album Ellende from 2013 was regarded as Ellendes first full length masterpiece. It was followed by a limited Gatefold vinyl of Weltennacht in 2014, in which P.F. started to take over studio-drums from now on. In 2016 Ellende released their second full length with the name Todbringer, which gained major attention in the atmospheric- and post-blackmetal scene. In march 2019 their third fulllength album Lebensnehmer was published by AOP records, which reached place 94 of german album charts in april. The record Triebe was released on 22. january 2021 as several limited gatefold vinyl editions (AOP Records, Napalm Records, Bandcamp) and digipack as well as digitally on all platforms. In 10 years of existence Ellende released their fourth full-length album Ellenbogengesellschaft in September 2022 which reached official german albumcharts on place 31 and official austrian albumcharts on place 21.\nhttps://www.facebook.com/ellende.official\nhttps://open.spotify.com/artist/1iLdVM2KFAHUbpaC5wpMbO...\nGroza:\nAs the world stands still, paralyzed and numb with fear, German black metal collective GROZA breaks the deafening silence to unveil their second full length album “The Redemptive End” – capturing the current times devastating atmosphere of utmost hopelessness and resignation.\nFounded as a one-man project by singer / guitarist P.G. in 2016, the band grew towards a full band in the following two years, culminating in the birth of their first effort - “Unified In Void” (2018). With its revelation through AOP Records, a storm was spawned to consume everything and everyone crossing its path, relentlessly raging with passion and wrath during many live rituals on tours and festivals all over Europe.\nAlthough the familiar rumble and chants of raw anger and despair continue to drone unabated on the successor, GROZA’s sound also explores new frontiers on the band’s latest album. For the first time, clean, even post-rock inspired passages shine deceptive rays of light through the dark, only to be devoured by searing melodies, drenched in sorrow and hopelessness and devastated by raging storms of blast beats, in the very next moments.\n“The Redemptive End” was recorded during the summer / autumn of 2020. Recorded and mixed by P.G. and mastered with the help of Michael Kraxenberger (Sick Of Sound), the six tracks of the album encapsulate the prevailing state of numbing isolation and desperation in sonic format.\nhttps://www.facebook.com/grozaband\nhttps://open.spotify.com/artist/5PC1B9qDXhyin3ZgyRcio7...\nServant:\nServant is a German black metal band from lower saxony which was founded in 2021 within the release of their well reviewed debut ‘Blessed By The Light Of A Thousand Stars’. However the band is just two and a half years old it doesn’t mean unknown musicians are operating here. Mastermind and Main Songwriter Farago was active in German Black metal bands like Andras and Ancient Wargod in the early to late nineties. Servant stands on the shoulders of great Scandinavian bands without the lack of an individual sound. Servant presents their style of Black metal both in a majestic and furious way.\nhttps://www.facebook.com/ServantMagick\nhttps://open.spotify.com/artist/49t1kAPqYOFmSz1gc5ZKjL...\n-------------------------------------------------------\nEntry: 165 kr in pre-sale / 185 kr at the door!\nPre-Sale:\nhttps://bit.ly/3RxbL0C",
            "genre": "atmospheric/black/metal",
            "url": "https://billetto.dk/e/e-914013/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Dool [NL] + Hangman's Chair [FR] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-10-15T08:00:00.0200",
                "endDate": "2024-10-15T11:59:00.0200"
            },
            "openingHours": "08:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/664c5fc502588e629a5c6f80/1716281874303/header-dhmc.jpg?format=1500w"
                }
            ],
            "body": "Det bliver en mørk og tung aften når Hollandske Dool besøger Danmark for første gang med et show på Stengade. De bringer de Franske doomede Hangman's Chair med sig.\nobs. billetsalget starter fredag d.24 maj kl:10!\nDool:\nPanta Rhei. Everything flows, nothing ever stays the same. Life itself is in a constant state of change. Personal change, physical change, psychological change, the ever-changing world around us. How does this affect us? And how do we keep being ourselves in a world that is so incredibly demanding and aggressive with all its input? We must be as fluid as water to navigate ourselves through this ocean of possibilities and uncertainties - and make peace with chaos and impermanence.\nAfter critically acclaimed first two albums ‘Here Now, There Then’ (2017) and ‘Summerland’ (2020), Dutch five-piece, DOOL, returns with a captivating and enthralling album that shows a band that has truly developed their own unique identity. Produced and mixed by Magnus Lindberg (Cult Of Luna, Russian Circles, Tribulation ) and mastered by Ted Jensen (Ghost, Mastodon, Muse, Talking Heads, AC/DC), ‘\nThe Shape Of Fluidity\n’ exhibits an eclectic but seamless mix between\nprogressive rock\n,\nmetal\nand\npost -rock\nin combination with a songwriting that doesn ’t lose sight of the inherent catchiness and dynamic backdrop that DOOL is so well known for.\n‘DOOL’, being derived from the Dutch word for ‘wandering’, originally emerged out of the ashes of ‘\nThe Devil’s Blood\n’ and ‘\nElle Bandita\n’ in 2015. By soul-searching their way through rhythms and melodies, debut album ‘\nHere Now, There Then\n’ was born. Not long after its release on German Prophecy Productions in 2017 the album was awarded\nMetal Hammer ’s ‘Debut Album Of The Year’\n. The album - which featured the cult hit ‘\nOweynagat’\n, with its accompanying ominous music video - also initiated the band’s fierce live reputation , by resulting in multiple headline tours throughout Europe.\nhttps://open.spotify.com/artist/101HSR6JTJqe3DBh6rb8kz...\nhttps://www.facebook.com/allthosewhowanderaredool/\nHangman's Chair:\nHangman's Chair, formed in 2005 in Paris, are one of the most unique sounding rock doom bands currently active. Through the years, they have found and fine-tuned their own unique sound signature, somewhere at the crossroads between Type O Negative, Life Of Agony and Sisters of Mercy, to name a few. Each album takes its strength and essence from the band members's own life experiences, which they write about always with unflinching honesty. Whether it's the loss of band members, drug overdoses or the hardships of living in suburban Paris, all those human emotions resonate within each of their songs as they embrace the darkness and transform it into something beautiful, heavy and melancholic. After 5 studio albums and a handful of splits / EPs, Hangman's Chair is releasing their 6th studio album, \"A LONER\". Their first record to be out on the German label NUCLEAR BLAST. About loneliness in all its forms, this record has all the trademarks that makes Hangman's Chair music so visceral, and will keep you in its tight grip from the very first listen.\nhttps://open.spotify.com/artist/3jmqk617nnjalSiZUCaaBi...\nhttps://www.facebook.com/hangmanschair/\n---------------------------------------------------------\nEntry: 195 kr in pre-sale / 210 kr at the door!\nTickets:\nhttps://bit.ly/3KqB7dH",
            "genre": "dark/rock",
            "url": "https://billetto.dk/e/e-1000368/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "The Devil & The Universe [AT] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-10-31T20:00:00.0100",
                "endDate": "2024-10-31T23:59:00.0100"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6603d7a925b1d57aee72e0ca/1715680285236/header-tdatu.jpg?format=1500w"
                }
            ],
            "body": "Vi fejrer halloween med goat wave fra The Devil & The Universe!\nThe Devil & The Universe:\nIn the musical vortex of utopian visions and wishful dream images of a future past! The new album from THE DEVIL & THE UNIVERSE whirls its way inside the ears of their audience, stirs up imaginations and carries you away.\nConceptually, GOATopia is based on such great utopians as Thomas Morus. His novel \"Utopia\" from 1516 is considered to be the starting point of the genre which formulates a possible future way of life or social order. Thomas Morus tells of a fictional island kingdom where new social concepts are lived. THE DEVIL & THE UNIVERSE use ideas like these and create their own goat utopia. In a world out of balance, the Viennese band is reluctant to face dystopian predictions. They unmask the spectre of the future to put the goat mask on it.\nThe result sounds electronically entranced with thundering drums. The goats devour Krautrock, chew it with relish and spit it out again as a tribal sphere with spoken word samples.\nTHE DEVIL & THE UNIVERSE now look back on nine years of band history. In 2013, Ashley Dayour and David Pfister founded the band, which Stefan Elsbacher complemented to a trio. In the beginning the band focused on musical experimentation with magical systems. It’s still firmly inscribed in the band's DNA.\nWith their mixture of soundtrack-like ambient sounds and driving beats, their goat masks and unmistakable humour, which especially shows in their visual representation, they drummed up a loyal fan base.\nOn GOATopia, THE DEVIL & THE UNIVERSE pick up the psychedelic feeling from the previous album :Endgame 69: and add new musical sounds. In doing so, they remain true to their principle, always finding new ways of expressing and not repeating themselves, even after nine years. Despite all the innovations, fans will recognize the unmistakable goat wave style, for which THE DEVIL & THE UNIVERSE are famous. The feet and hooves will twitch, for sure!\nWith magic, occultism and a healthy dose of self-irony, GOATopia hallucinates the missed opportunities of the past without mourning them. Utopias are created, destroyed and rebuilt again. Utopia is dead. Long live Goatopia. Viva! GOATopia!\nhttps://www.facebook.com/TheDevilAndTheUniverse/\nhttps://open.spotify.com/artist/4CQYX5451pk6EbyEHJ8ie8...\n+ Support: TBA\n------------------------------------------------\nEntry: Entry: 135 kr (limited amount early-bird on sale until 30th of april!) / 155 kr in pre-sale / 175 kr at the door!\nTickets:\nhttps://bit.ly/3IVmaj0",
            "genre": "goatwave",
            "url": "https://billetto.dk/e/e-972651/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Leap [UK] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-11-01T08:00:00.0100",
                "endDate": "2024-11-02T02:00:00.0100"
            },
            "openingHours": "08:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6647126aeceb152a52f02d4b/1715934289948/header-leap.jpg?format=1500w"
                }
            ],
            "body": "Det bliver britisk indie pop rock når det er bedst der Leap besøger Stengade og Danmark for første gang!\nLeap:\nRaucous indie pop-rockers LEAP present the ONE WAY OUT tour. The past 18 months have been completely game-changing, and this tour is another powerful step-up as the band goes from strength to strength. With dozens of sold-out shows across the UK and Europe, it’s the reaction to the band’s explosive live show that is driving a highly-engaged international fanbase. The first 2 EPs have seen a swell of editorial support across DSPs, with new single One Way Out serving as further proof of the band’s intoxicating blend of hard rock and anthemic pop. 2024 is already shaping up to be another year of accelerated growth, with a main-stage slot at Nova Rock and over 10,000 tickets on sale for LEAP headline shows. With a commercial radio hit in Italy to add to a growing list of supporters at the likes of Rolling Stone, MTV, Virgin Radio, Flux FM, BBC Radio 6, BBC Introducing, LEAP are fast-approaching undeniable status in the UK and Europe’s thriving rock scene.\nhttps://open.spotify.com/artist/538iX6YCTybcgzsrjDTrFi...\nhttps://www.facebook.com/leaptheband\n+ Support: TBA\n-------------------------------------------------\nEntry: 155 kr in pre-sale / 175 kr at the door!\nTickets:\nhttps://bit.ly/4adkqgd",
            "genre": "indie/rock",
            "url": "https://www.stengade.dk/show/2024/11/1/leap-uk-support-tba",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Master Boot Record [IT] — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-11-06T20:00:00.0100",
                "endDate": "2024-11-06T23:59:00.0100"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/661f72198c0c71021b593ac7/1715179815504/header-mbr.jpg?format=1500w"
                }
            ],
            "body": "Efter komplet udsolgt koncert i 2023 kommer Master Boot Record igen forbi Stengade med deres blanding af avant-garde chiptune, synthesized heavy metal & classical symphonic music.\nMaster Boot Record:\nMASTER BOOT RECORD (aka MBR) is a project founded in 2016 by producer Victor Love (AKA Vittorio D’amore) mixing together heavy metal and synthesized electronic music. The project as a live band started their live activity in 2018 including renowned live performing artists such as the guitar virtuoso and Ibanez endorser Edoardo Taddei at lead guitars and technical death metal drummer Giulio Galati.\nMBR released 14 albums so far with multiple record labels and has been one of the most successful musicians on US digital distribution platform Bandcamp charting #1 in general charts several times. Because of that Bandcamp often featured the albums and made interviews directly with the artist.\nStarting in 2016 releasing albums under the indie label Data Airlines has moved in 2018 to synthwave iconic label Blood Music to expand its audience to the electronic community. In 2019 MASTER BOOT RECORD settled with Metal Blade Records, the historic metal label based in Los Angeles to release the latest two albums “Floppy Disk Overdrive (2020)” and “Personal Computer(2022)” helping the project to gain increased popularity worldwide.\nMBR has also produced the video game “VirtuaVerse” as well as its original soundtrack. VirtuaVerse was released in 2020 on all gaming platforms as well as Nintendo Switch, Xbox and Playstation.\nThe rapid growth of the project sparked an intense live activity that culminated in 2023 with over 42 shows including 2 full tours in Europe and UK as well as participation in renowned European festivals such as Resurrection Fest (Spain), Euroblast (Germany),\nComplexity fest (Netherlands), Resistanz Festival (UK), SWR Fest (Portugal), Frantic Fest (Italy).\nThe band is currently scheduled to perform at major european festival Brutal Assault (Czech Rep.) in summer 2024 and has recently joined major booking agencies Doomstar booking in Europe and Heavy Talent in North America to increase their live activity in the future.\nhttps://open.spotify.com/artist/77s5NAGQbxu8oLstaqSwHE?si=xaoN47o1TJy7M0d1ENFHUg\nhttps://masterbootrecord.bandcamp.com/\nhttps://www.facebook.com/masterbootrecordmusic/\n----------------------------------------------------------------------\nEntry: 150 kr in pre-sale / 175 kr at the door!\nTickets: https://bit.ly/4aYDwYh",
            "genre": "synthwave",
            "url": "https://billetto.dk/e/e-981035/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Summons + Special Guests: Melan Tropic — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-11-09T20:00:00.0100",
                "endDate": "2024-11-10T02:00:00.0100"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/662a0c52f60e727750a6255d/1715179876159/header-smt.jpg?format=1500w"
                }
            ],
            "body": "Summons er tilbage med storslået og intimt alt-rock og de gæster Stengade sammen med Melan Tropic som byder op til 80’er-inspireret synth pop d. 09 november!\nSummons:\nAfter many years of hiatus, reformed Danish band SUMMONS returns with the EP ‘Past is Now Now is Past’, which in its both grandiose and intimate alt-rock compositions explores personal fragments of the past and how they are seen, understood, and felt now, so many years later.\nSUMMONS was originally formed in 1990 during the members’ early teenage years, and until its dissolution in 1997, the band recorded five EPs and played numerous concerts. After the band disbanded, the friendships persisted over the years, while the members pursued various and diverse musical expressions and paths through life.\nDuring a shared trip to Moen in November 2022, two new songs emerged almost out of nowhere, unexpectedly and effortlessly, as if no time had passed since then. As the new music was realized in a rehearsal space, more songs arose, leading to a situation that none of those involved had quite anticipated - the desire and urge to be a band again.\nOut of this renewed inspiration, a total of five songs were born, now constituting ‘Past is Now Now is Past’. All the EP's tracks have a distinctive melodiousness, melancholy, and exploratory nature at their core, with forays into more ambient and dreamy soundscapes, as in 'Water', where SUMMONS delves deep into a captivating and undiscovered underworld.\n‘Past is Now Now is Past’ was recorded live in the studio in collaboration with producer Morten Bue (Diefenbach, Figurines, I Got You On Tape a.o.). Bue captured SUMMONS' energy as a rock band as well as the nuances of the songwriting, creating a resonant, dynamic expression staying true to the band's desire to create an EP that one can feel and be moved by.\nThe EP’s lyrics are built on fragments of memories from the past seen through the existential prism of the now-adult individual. The five band members shared a childhood and youth, and in the present, all these experiences come together in a unified artistic expression simultaneously retrospective and forward-looking, as illustrated in the EP's ambiguous title.\nhttp://www.facebook.com/summonsdk\nhttp://www.instagram.com/summonsdk\nhttps://www.youtube.com/@Summonsdk\nMelan Tropic:\nMELAN TROPIC is a new 80s-inspired synth pop duo from Denmark. Formed in 2020, Klaus Pelle and Morten Grønnegaard grew up together during the 80s, in the suburb Rønne Syd, on the small island of Bornholm. Their friendship flourished at high school, built on a shared love of movies, comics, illustration and music. Since those halcyon days, a lot has happened, but despite the many obstacles of adulthood, the two always found their way back together.\nMELAN TROPIC release their debut EP ‘Melantropi’ on September 9, 2022. This collaboration originally started as a hobby, mostly as an excuse to spend more time together. But the two quickly grew more ambitious, with music informed and fuelled by an ongoing fascination of the 80s pop culture that influenced their formative years together. Experienced musician Grønnegaard crafted composition and instrumentation, while Pelle took on the role of lead singer and lyricist.\nAcross the EP’s six tracks, MELAN TROPIC strikes an authentic 80s sound, both in melodies and songwriting, where pop hooks, bold production and challenging lyrical content go hand in hand.\nThe duo ignores the typically forbidden tropes of the 90s music they also grew up with, instead reaching back to an earlier time when reverb, gated drums and massive guitar solos were celebrated to the full. Inspired by Tears for Fears, Ultravox, Mr. Mister and 80s soundtracks, as well as contemporary synth bands like Drab Majesty and Gunship, MELAN TROPIC create music that is both vibrant and personal. Morten says:\n“Our music has its origins in 80s pop culture - a culture we were part of back in the day. Part of what drives us is a search for how things used to be. The melancholy pulls at us, as it does to so many others, as we get older and try to define the men we have become. Hence MELAN. The name was actually MELANTROPI at first, but when the music started to develop it was clear that there was also a more positive and celebratory vibe present. That's why tropi became TROPIC!”\nAt the center are the Danish lyrics, but not used ironically, nor mocking the superficiality of the 80s. Pelle’s lyrics are serious, reflecting pain and a measured splash of satire. They are from the adult male perspective and driven by the deep personal experiences the duo shared throughout their long friendship - from ecstatic joy to almost indescribable sorrow. MELAN TROPIC is the sound of yesterday, revitalized today by people who were there back then and are here still. These are songs about the impact of days gone, seen and heard with the eyes and ears of today, and with eternal love for a golden musical era that still endures.\nwww.facebook.com/melantropicband\nwww.instagram.com/melantropicband\nwww.youtube.com/melantropicband\n-------------------------------------------------\nEntry: 140 kr in pre-sale / 160 kr at the door!\nTickets: https://bit.ly/3QiIBCy",
            "genre": "alt/rock",
            "url": "https://billetto.dk/e/e-984906/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        },
        {
            "title": "Hazlett [AU/SE] + Support: TBA — Spillestedet Stengade",
            "monthlySchedule": {
                "startDate": "2024-11-16T20:00:00.0100",
                "endDate": "2024-11-17T02:00:00.0100"
            },
            "openingHours": "20:00",
            "photos": [
                {
                    "provider": "http://static1.squarespace.com/static/5a967f653c3a538b735efaa4/5a9ea53cec212d0cc09ee048/6654331701dd2d42022ff5f6/1716798601521/header-hazlett1.jpg?format=1500w"
                }
            ],
            "body": "Hazlett presents ‘The Goodbye Tour’ - After years of opening for friends and fellow artists around the world Hazlett returns to Europe and the UK for a tour of his own. An evening of telling stories, singing songs and of course getting to meet all of you, the ones that inspired the music and kept him going on this journey.\nHazlett:\nIndie Folk singer Hazlett was born and raised in Australia but if the past few years are anything to go by, he’s very much bloomed in Sweden. An old friend, one big break-up and playing Oasis’ 'Wonderwall' three times a night was the unplanned cocktail of moments that saw him throw adulthood to the wayside and venture to the other side of the world.\nA pocket full of nerves and a tangled mess of memories became the start of Hazlett’s unique brand of “Indie Ballroom Folk”. But everything crystallised one summer in Stockholm after finding the fabled collaborator chemistry in now close friend Freddy Alexander. A lot has changed since then and what started as a way for him to “figure out some things in his head…” has now become a whole world of music and beautiful details to move through.\nEven though the nerves never quite go away, there’s this newfound quiet confidence to the troubadour from down under. You may not have met, but sometimes when you’re listening to Hazlett, he feels like the only friend you’ve ever had.\nAt the beginning of 2024, he performed as the opening act for LANY in North America and Callum Scott in Europe. Prior to embarking on his headline tour in the UK and Europe in November, he is scheduled to perform as the support act for Ocie Elliott and Passenger in Europe, reunite with LANY in Australia, and return to the US for additional shows.\nhttps://open.spotify.com/artist/1zO3MgzmcwZLLNUQqeU2XH?si=MmUsjTzBQseY57haFbcDdg\nhttps://www.facebook.com/thisishazlett/\n+ Support: TBA\n--------------------------------------------------\nEntry: 170 kr in pre-sale / 195 kr at the door!\nTickets: https://bit.ly/3UVnF69\nTickets on sale Friday the 31st of May at 10am.",
            "genre": "gospel",
            "url": "https://billetto.dk/e/e-1009221/select?color=%23459197",
            "postType": "Music",
            "channel": "@public",
            "parent": "ROOT",
            "address": "",
            "locationLatitude": "55.68819",
            "locationLongitude": "12.55569509999998"
        }
    ]
}